POST /api/v3/orders
Эндпоинт предназаначен для создания заказа

Входные/выходные параметры 

| №  | Имя параметра    | Тип (Java) | Описание                                 | Обязательное |
| -- | ---------------- | ---------- | ---------------------------------------- | ------------ |
| 1  | orderName        | string     | Наименование заказа                      | да           |
| 2  | orderTypeId      | int        | Идентификатор вида заказа                | да           |
| 3  | actTypeId        | int        | Идентификатор вида работ ТОРО            | да           |
| 4  | plantId          | int        | Идентификатор завода                     | да           |
| 5  | techPlaceId      | int        | Идентификатор технического места         | да           |
| 6  | equipmentId      | int        | Идентификатор единицы оборудования       | нет          |
| 7  | priorityId       | int        | Приоритет заказа                         | да           |
| 8  | workCenterId     | int        | Идентификатор участка                    | да           |
| 9  | planGroupId      | int        | Идентификатор группы планирования        | да           |
| 10 | startDate        | timestamp  | Запланированная дата начала              | да           |
| 11 | endDate          | timestamp  | Запланированная дата окончания           | нет          |
| 12 | defectId         | int        | Идентификатор дефекта                    | нет          |
| 13 | defectIds        | array[int] | Список идентификаторов дефектов          | нет          |
| 14 | techCardId       | int        | Идентификатор технологической карты      | нет          |
| 15 | requiresApproval | boolean    | Признак необходимости утверждения заказа | нет          |
| 16 | orderDescription | string     | Описание заказа                          | нет          |
| 17 | createDate       | timestamp  | Дата создания записи                     | нет          |

Логика работы метода создания заказа
1. Проверка входных параметров

Проверить заполнение поля techPlaceId.

Если поле не заполнено — вернуть уведомление:
«Не заполнен код технического места».

Проверить заполнение поля equipmentId.

Если equipmentId не заполнено, заказ создаётся по указанному techPlaceId.

2. Проверки по связанным сообщениям (defects)

Если во входных параметрах передан массив defectIds, необходимо выполнить следующие проверки:

Проверка существования сообщений

Проверить, что все переданные идентификаторы существуют в таблице DEFECTS (id).

Если проверка не пройдена — вернуть ошибку:

HTTP 409

Сообщение:
«Некоторые сообщения не найдены, создание заказа невозможно»

Проверка статуса сообщений

Проверить, что все сообщения имеют статус, допустимый для создания заказа:
DEFECTS.status_id = 13 (в работе).

Если проверка не пройдена — вернуть ошибку:

HTTP 409

Сообщение:
«Некоторые сообщения имеют недопустимый статус для создания заказа»

Проверка завода

Проверить, что все сообщения относятся к одному заводу:
DEFECTS.plant_id у всех переданных сообщений должен совпадать.

Если проверка не пройдена — вернуть ошибку:

HTTP 409

Сообщение:
«Заводы сообщений не совпадают, создание заказа невозможно»

Проверка группы плановиков

Проверить, что все сообщения относятся к одной группе плановиков:
DEFECTS.plangroup_id у всех переданных сообщений должен совпадать.

Если проверка не пройдена — вернуть ошибку:

HTTP 409

Сообщение:
«Группа плановиков сообщений не совпадает, создание заказа невозможно»

Проверка участка

Проверить, что все сообщения относятся к одному участку:
DEFECTS.work_center_id у всех переданных сообщений должен совпадать.

Если проверка не пройдена — вернуть ошибку:

HTTP 409

Сообщение:
«Участки сообщений не совпадают, создание заказа невозможно»

3. Создание записи в таблице ORDER
